# Oracle SQL Practice Exercises

Formatted for readability – each query fits neatly without horizontal scrolling.

### Display current timestamp and session timestamp

In [ ]:
SELECT 
    SYSTIMESTAMP AS system_ts, 
    CURRENT_TIMESTAMP AS session_ts 
FROM DUAL;

### Show system date vs timestamp precision

In [ ]:
SELECT 
    SYSDATE AS system_date, 
    SYSTIMESTAMP AS system_timestamp 
FROM DUAL;

### Create a timestamp literal

In [ ]:
SELECT 
    TIMESTAMP '2025-10-05 14:35:55.123456' AS ts_literal 
FROM DUAL;

### Convert New York time to India time zone

In [ ]:
SELECT 
    FROM_TZ(
        TIMESTAMP '2025-10-05 08:00:00', 
        'America/New_York'
    ) AT TIME ZONE 'Asia/Kolkata' AS ny_to_ist 
FROM DUAL;

### Show timestamp with local time zone

In [ ]:
SELECT 
    CAST(SYSTIMESTAMP AS TIMESTAMP WITH LOCAL TIME ZONE) AS ts_ltz 
FROM DUAL;

### Change session time zone and show difference

In [ ]:
ALTER SESSION SET TIME_ZONE = '+02:00';

SELECT 
    CURRENT_DATE AS curr_date_session_tz, 
    CURRENT_TIMESTAMP AS curr_ts_session_tz, 
    SYSTIMESTAMP AS sys_ts_host_tz 
FROM DUAL;

### Add 2 days and subtract 5 hours from current timestamp

In [ ]:
SELECT 
    SYSTIMESTAMP + INTERVAL '2' DAY AS plus_2_days, 
    SYSTIMESTAMP - INTERVAL '5' HOUR AS minus_5_hours 
FROM DUAL;

### Add 90 minutes and 2 months using interval functions

In [ ]:
SELECT 
    SYSTIMESTAMP + NUMTODSINTERVAL(90, 'MINUTE') AS plus_90_min, 
    SYSTIMESTAMP + NUMTOYMINTERVAL(2, 'MONTH') AS plus_2_months 
FROM DUAL;

### Convert string to timestamp

In [ ]:
SELECT 
    TO_TIMESTAMP(
        '2025-10-05 15:45:33.123', 
        'YYYY-MM-DD HH24:MI:SS.FF3'
    ) AS to_ts 
FROM DUAL;

### Cast date to timestamp and timestamp to date

In [ ]:
SELECT 
    CAST(SYSDATE AS TIMESTAMP) AS cast_to_ts, 
    CAST(SYSTIMESTAMP AS DATE) AS cast_to_date 
FROM DUAL;

### Format timestamp with time zone region

In [ ]:
SELECT 
    TO_CHAR(
        SYSTIMESTAMP, 
        'YYYY-MM-DD HH24:MI:SS.FF3 TZR'
    ) AS formatted_ts 
FROM DUAL;

### Extract components from timestamp

In [ ]:
SELECT 
    EXTRACT(YEAR FROM SYSTIMESTAMP) AS yr, 
    EXTRACT(MONTH FROM SYSTIMESTAMP) AS mon, 
    EXTRACT(DAY FROM SYSTIMESTAMP) AS dy, 
    EXTRACT(HOUR FROM SYSTIMESTAMP) AS hr, 
    EXTRACT(MINUTE FROM SYSTIMESTAMP) AS mi, 
    EXTRACT(SECOND FROM SYSTIMESTAMP) AS sec 
FROM DUAL;

### Round and truncate timestamp values

In [ ]:
SELECT 
    ROUND(SYSTIMESTAMP, 'HH') AS rounded_hour, 
    TRUNC(SYSTIMESTAMP, 'DD') AS trunc_day 
FROM DUAL;

### Find difference between two timestamps

In [ ]:
SELECT 
    (TO_TIMESTAMP('2025-10-05 18:00:00', 'YYYY-MM-DD HH24:MI:SS') - 
     TO_TIMESTAMP('2025-10-05 14:00:00', 'YYYY-MM-DD HH24:MI:SS')) 
    DAY TO SECOND AS diff_interval 
FROM DUAL;

### Calculate time difference in minutes between two timestamps

In [ ]:
SELECT 
    EXTRACT(DAY FROM (t2 - t1)) * 24 * 60 + 
    EXTRACT(HOUR FROM (t2 - t1)) * 60 + 
    EXTRACT(MINUTE FROM (t2 - t1)) AS diff_minutes 
FROM (
    SELECT 
        TO_TIMESTAMP('2025-10-05 18:00:00', 'YYYY-MM-DD HH24:MI:SS') AS t2, 
        TO_TIMESTAMP('2025-10-05 15:00:00', 'YYYY-MM-DD HH24:MI:SS') AS t1 
    FROM DUAL
);

### Compute project deadline 45 days and 6 hours ahead

In [ ]:
SELECT 
    SYSTIMESTAMP + INTERVAL '45' DAY + INTERVAL '6' HOUR AS project_deadline 
FROM DUAL;

### Check if current time is within office hours (9 AM–6 PM)

In [ ]:
SELECT 
    CASE 
        WHEN TO_NUMBER(TO_CHAR(SYSTIMESTAMP, 'HH24')) BETWEEN 9 AND 18 
        THEN 'Within Office Hours' 
        ELSE 'Outside Office Hours' 
    END AS office_window 
FROM DUAL;

### Calculate days since each employee was hired

In [ ]:
SELECT 
    e.ename, 
    e.hiredate, 
    TRUNC(SYSDATE - e.hiredate) AS days_since_hired 
FROM emp e;

### Compute years, months, and days of experience for each employee

In [ ]:
SELECT 
    e.ename, 
    FLOOR(MONTHS_BETWEEN(SYSDATE, e.hiredate) / 12) AS years, 
    MOD(FLOOR(MONTHS_BETWEEN(SYSDATE, e.hiredate)), 12) AS months, 
    TRUNC(
        SYSDATE - ADD_MONTHS(
            e.hiredate, 
            FLOOR(MONTHS_BETWEEN(SYSDATE, e.hiredate) / 12) * 12 + 
            MOD(FLOOR(MONTHS_BETWEEN(SYSDATE, e.hiredate)), 12)
        )
    ) AS days 
FROM emp e;

### Display exact interval of service using TIMESTAMP difference

In [ ]:
SELECT 
    e.ename, 
    (SYSTIMESTAMP - CAST(e.hiredate AS TIMESTAMP)) AS exact_service_interval 
FROM emp e;

### List employees hired in the last 6 months

In [ ]:
SELECT 
    e.ename, 
    e.hiredate 
FROM emp e 
WHERE e.hiredate > ADD_MONTHS(SYSDATE, -6);

### Show employees hired on weekend days

In [ ]:
SELECT 
    e.ename, 
    e.hiredate, 
    TO_CHAR(e.hiredate, 'DY') AS dow 
FROM emp e 
WHERE TO_CHAR(e.hiredate, 'DY') IN ('SAT', 'SUN');

### Calculate department-wise average experience in months

In [ ]:
SELECT 
    d.dname, 
    ROUND(AVG(MONTHS_BETWEEN(SYSDATE, e.hiredate)), 1) AS avg_exp_months 
FROM emp e 
JOIN dept d ON e.deptno = d.deptno 
GROUP BY d.dname;

### Count hires per month based on timestamp format

In [ ]:
SELECT 
    TO_CHAR(CAST(hiredate AS TIMESTAMP), 'YYYY-MM') AS yyyymm, 
    COUNT(*) AS hires 
FROM emp 
GROUP BY TO_CHAR(CAST(hiredate AS TIMESTAMP), 'YYYY-MM') 
ORDER BY yyyymm;

### List employees whose hire date matches today's month and day

In [ ]:
SELECT 
    e.ename, 
    e.hiredate 
FROM emp e 
WHERE EXTRACT(MONTH FROM CAST(e.hiredate AS TIMESTAMP)) = EXTRACT(MONTH FROM SYSTIMESTAMP) 
  AND EXTRACT(DAY FROM CAST(e.hiredate AS TIMESTAMP)) = EXTRACT(DAY FROM SYSTIMESTAMP);

### Show first and last moment of the current month

In [ ]:
SELECT 
    TRUNC(SYSTIMESTAMP, 'MM') AS month_start_ts, 
    ADD_MONTHS(TRUNC(SYSTIMESTAMP, 'MM'), 1) - NUMTODSINTERVAL(1, 'SECOND') AS month_end_ts 
FROM DUAL;